In [11]:
import pandas as pd

In [12]:
Student = pd.read_csv("C:\\Users\\CSINFO17\\AI_Lab\\Student.csv")
Marks = pd.read_csv("C:\\Users\\CSINFO17\\AI_Lab\\Marks.csv")
df_merge = pd.merge(Student,Marks,on = 'Student_Id')
df_merge

   Student_Id         Name Subject  M1  M2  M3
0           1       Pawan       AI  98  99  89
1           2      Nithesh    DBMS  78  90  86
2           3  Ronith.B.G.  Python  89  89  89
3           4     Preetham    JAVA  78  78  98
4           5     Swasthik   Maths  90  89  99